<a href="https://colab.research.google.com/github/anish6701/DE_Assignments/blob/main/SQL_11thSeptember.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1) install required libraries
2) import those libraries
3) include those libraries

! (exclaimation) is only used for colab.

In [ ]:
!pip install ipython-sql
%load_ext sql

%sql sqlite://

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (71.0.4)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

In [ ]:
%%sql
create table dim_product(
  product_id INT primary_key,
  product_name varchar(50),
  product_category varchar(50));

insert into dim_product(product_id, product_name, product_category) values
  (1, 'laptop','electronics'),
  (2, 'smartphone','electronics'),
  (3, 'tshirt','clothing');

create table dim_customer(
  cust_id INT primary_key,
  cust_name varchar(50),
  city varchar(50));

insert into dim_customer(cust_id, cust_name, city) values
  (101, 'sameer','toronto'),
  (102, 'raj','newmarket'),
  (103, 'gopal','aurora');

create table fact_sales(
  sale_id INT primary_key,
  product_id INT,
  cust_id INT,
  sale_date DATE,
  quantity INT,
  amount decimal(10,2),
  FOREIGN KEY (product_id) references dim_product(product_id),
  FOREIGN KEY (cust_id)references dim_customer(cust_id)
  );


insert into fact_sales(sale_id,product_id,cust_id, sale_date, quantity, amount) values
  (1,1,101, '2024-09-11',2,1500.00),
  (2,2,102, '2024-09-12',3,1487.98),
  (3,3,103, '2024-09-13',2,1789.75);

 * sqlite://
Done.
3 rows affected.
Done.
3 rows affected.
Done.
3 rows affected.

[]

In [ ]:
%%sql
select * from dim_product;

 * sqlite://
Done.

[(1, 'laptop', 'electronics'),
 (2, 'smartphone', 'electronics'),
 (3, 'tshirt', 'clothing')]

In [ ]:
%%sql
select * from dim_customer;

 * sqlite://
Done.

[(101, 'sameer', 'toronto'),
 (102, 'raj', 'newmarket'),
 (103, 'gopal', 'aurora')]

In [ ]:
%%sql
select * from fact_sales;

 * sqlite://
Done.

[(1, 1, 101, '2024-09-11', 2, 1500),
 (2, 2, 102, '2024-09-12', 3, 1487.98),
 (3, 3, 103, '2024-09-13', 2, 1789.75)]

In [ ]:
%%sql
select * from fact_sales
where sale_id==2;

 * sqlite://
Done.

[(2, 2, 102, '2024-09-12', 3, 1487.98)]

In [ ]:
%%sql
select * from fact_sales
where amount <=1500 and quantity >2 ;

 * sqlite://
Done.

[(2, 2, 102, '2024-09-12', 3, 1487.98)]

In [ ]:
%%sql
select * from fact_sales where sale_date between '2024-09-01' and '2024-09-11';

 * sqlite://
Done.

[(1, 1, 101, '2024-09-11', 2, 1500)]

In [ ]:
%%sql
select * from fact_sales order by amount desc;

 * sqlite://
Done.

[(3, 3, 103, '2024-09-13', 2, 1789.75),
 (1, 1, 101, '2024-09-11', 2, 1500),
 (2, 2, 102, '2024-09-12', 3, 1487.98)]